cask_args appdir: "/Applications"
tap "caskroom/cask"

brew "antigen"
brew "flow"
brew "git"
brew "git-extras"
brew "haskell-stack"
brew "neovim"
brew "nvm"
brew "python3"
brew "reattach-to-user-namespace"
brew "tmux"
brew "watchman"
brew "yarn", args: ["without-node"]
brew "zsh"
brew "zsh-completions"

cask "caffeine"
cask "divvy"
cask "firefox"
cask "google-chrome"
cask "iterm2"
cask "react-native-debugger"
cask "sketch"
cask "transmit"
