# Taps ########################################################################
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"

# Application Path ############################################################
cask_args appdir: "/Applications"

# Binaries/Libraries ##########################################################

brew "fish"
brew "git"
brew "git-lfs"
brew "git-extras"
brew "ollama"
brew "rsync"

# Language ####################################################################
# brew "rust"                                           # Safe, concurrent, practical language
# brew "oven-sh/bun/bun"                                # Incredibly fast JavaScript runtime, bundler, transpiler and package manager.

# Utils #######################################################################
brew "fnm"                                            # Node version manager built in Rust
brew "youtube-dl"                                     # Youtube Download Cli
brew "cloc"                                           # Statistics utility to count lines of code
cask "keycastr"                                       # Keystroke visualizer

# Apps #############################################################################################
cask "ghostty"
cask "google-chrome"
cask "obsidian"
cask "cursor"
cask "visual-studio-code"

# Fonts #######################################################################
cask "font-fira-code"
cask 'font-fira-mono'
cask 'font-fira-sans'
cask 'font-fira-code-nerd-font'
cask "font-powerline-symbols"
