# Application Path ############################################################
cask_args appdir: "/Applications"

# Binaries/Libraries ##########################################################

tap "oven-sh/bun"
brew "bun"
brew "git"
brew "git-lfs"
brew "git-extras"
brew "oh-my-posh"
cask "ollama"
brew "pnpm"
brew "rsync"
brew "zsh"

# Language ####################################################################
# brew "rust"                                           # Safe, concurrent, practical language
# brew "oven-sh/bun/bun"                                # Incredibly fast JavaScript runtime, bundler, transpiler and package manager.

# Utils #######################################################################
brew "fnm"                                            # Node version manager built in Rust
brew "cloc"                                           # Statistics utility to count lines of code
cask "keycastr"                                       # Keystroke visualizer

# Apps #############################################################################################
cask "ghostty"
cask "google-chrome"
cask "little-snitch"                                    # Network Monitor
cask "obsidian"
cask "orbstack"                                         # Drop-in replacement for Docker Desktop
cask "cursor"
cask "visual-studio-code"

# Fonts #######################################################################
cask "font-cascadia-code"
cask "font-fira-code"
cask "font-fira-mono"
cask "font-fira-sans"
cask "font-fira-code-nerd-font"
cask "font-jetbrains-mono"
cask "font-powerline-symbols"
cask "font-sf-mono"
