tap "jandedobbeleer/oh-my-posh"
tap "oven-sh/bun"

brew "agent-browser"
brew "cloc"
brew "direnv"
brew "gh"
brew "git"
brew "git-extras"
brew "git-lfs"
brew "jj"
brew "lazygit"
brew "opencode"
brew "python@3.14"
brew "stow"
brew "uv"
brew "zsh"
brew "jandedobbeleer/oh-my-posh/oh-my-posh"
brew "oven-sh/bun/bun"

cask "chatgpt"
cask "codex"
cask "discord"
cask "ghostty"
cask "google-chrome"
cask "keycastr"
cask "little-snitch"
cask "obsidian"
cask "ollama-app"
cask "orbstack"
cask "reader"
cask "slack"
cask "supacode"
cask "visual-studio-code"
cask "zed"

cask "font-cascadia-code"
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "font-fira-mono"
cask "font-fira-sans"
cask "font-jetbrains-mono"
cask "font-powerline-symbols"
cask "font-sf-mono"

vscode "alefragnani.project-manager"
vscode "anthropic.claude-code"
vscode "bierner.markdown-mermaid"
vscode "effectful-tech.effect-vscode"
vscode "mkhl.direnv"
vscode "ms-playwright.playwright"
vscode "vitest.explorer"
vscode "vscodevim.vim"
