# Application Path ############################################################
cask_args appdir: "/Applications"

# Binaries/Libraries ##########################################################
brew "codex"                                # OpenAI's coding agent that runs in your terminal
brew "direnv"                               # Load/unload env variables per project
brew "gemini-cli"                           # Interact with Google Gemini AI models from the command-line
brew "git"
brew "git-lfs"
brew "git-extras"
brew "oh-my-posh"
# brew "pnpm"
brew "rsync"
brew "zsh"

# Language ####################################################################
# brew "rust"                                 # Safe, concurrent, practical language
# brew "oven-sh/bun/bun"                      # JavaScript runtime, bundler, transpiler and package manager

# Utils #######################################################################
# brew "fnm"                                # Node version manager built in Rust
brew "cloc"                                 # Statistics utility to count lines of code
cask "keycastr"                             # Keystroke visualizer

# Apps ########################################################################
cask "chatgpt"                              # OpenAI's official ChatGPT desktop app
cask "claude"                               # AI assistant by Anthropic
cask "claude-code"                          # Native macOS app for Claude AI
cask "discord"                              # Chat for communities and friends
cask "ghostty"                              # Terminal emulator
cask "google-chrome"                        # Web browser
cask "little-snitch"                        # Network Monitor
cask "obsidian"                             # Knowledge base that works on local Markdown files
cask "ollama"                               # Run and manage LLMs locally
cask "orbstack"                             # Drop-in replacement for Docker Desktop
cask "reader"                               # Readwise Reader
cask "slack"                                # Team communication
cask "visual-studio-code"                   # Code editor
cask "zed"                                  # Multiplayer code editor

# Fonts #######################################################################
cask "font-cascadia-code"
cask "font-fira-code"
cask "font-fira-mono"
cask "font-fira-sans"
cask "font-fira-code-nerd-font"
cask "font-jetbrains-mono"
cask "font-powerline-symbols"
cask "font-sf-mono"
