# Application Path ############################################################
cask_args appdir: "/Applications"

# Binaries/Libraries ##########################################################
brew "direnv"                               # Load/unload env variables per project
brew "gemini-cli"                           # Interact with Google Gemini AI models from the command-line
brew "gh"                                   # GitHub CLI
brew "git"                                  # Version control system
brew "git-lfs"                              # Git extension for versioning large files
brew "git-extras"                           # Additional commands for git
brew "jj"                                   # Git alternative with a focus on speed and simplicity
brew "oh-my-posh"
brew "opencode"                             # Open source AI coding agent built for the terminal
# brew "pnpm"
brew "rsync"
brew "stow"                                 # Symlink manager for my dotfiles
brew "uv"                                   # Extremely fast Python package installer and resolver, written in Rust
brew "zsh"

# Language ####################################################################
# brew "rust"                                 # Safe, concurrent, practical language
brew "oven-sh/bun/bun"                      # JavaScript runtime, bundler, transpiler and package manager
brew "python"                               # Interpreted, interactive, object-oriented programming language

# Utils #######################################################################
# brew "fnm"                                # Node version manager built in Rust
brew "cloc"                                 # Statistics utility to count lines of code
cask "keycastr"                             # Keystroke visualizer

# Apps ########################################################################
cask "chatgpt"                              # OpenAI's official ChatGPT desktop app
cask "claude"                               # AI assistant by Anthropic
cask "claude-code"                          # Native macOS app for Claude AI
cask "codex"                                # OpenAI's coding agent that runs in your terminal
cask "discord"                              # Chat for communities and friends
cask "ghostty"                              # Terminal emulator
cask "google-chrome"                        # Web browser
cask "little-snitch"                        # Network Monitor
cask "obsidian"                             # Knowledge base that works on local Markdown files
cask "ollama-app"                           # Run and manage LLMs locally
cask "orbstack"                             # Drop-in replacement for Docker Desktop
cask "reader"                               # Readwise Reader
cask "slack"                                # Team communication
cask "visual-studio-code"                   # Code editor
cask "voiceink"                             # Voice to text
cask "zed"                                  # Multiplayer code editor

# Fonts #######################################################################
cask "font-cascadia-code"
cask "font-fira-code"
cask "font-fira-mono"
cask "font-fira-sans"
cask "font-fira-code-nerd-font"
cask "font-jetbrains-mono"
cask "font-powerline-symbols"
cask "font-sf-mono"
